cases/heat-conduction/2D-heat-conduction-on-a-10-by-10-mesh/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    topInsulatedWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          10;
        startFace       180;
    }
    bottomInsulatedWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          10;
        startFace       190;
    }
    leftFixedWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          10;
        startFace       200;
    }
    rightFixedWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          10;
        startFace       210;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          200;
        startFace       220;
    }
)

// ************************************************************************* //
